; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 188228 1 3 4 7 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph3 - mode
	thermograph2 - mode
	infrared0 - mode
	image1 - mode
	Star2 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star5 - direction
	Star3 - direction
	GroundStation0 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
)
(:goal (and
	(have_image Planet7 thermograph2)
	(have_image Planet8 thermograph3)
	(have_image Phenomenon9 thermograph3)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 3
2. (turn_to satellite0 planet8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet8)
   goals met: 0 of 3
3. (turn_to satellite0 groundstation0 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 3
4. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 0 of 3
5. (turn_to satellite0 planet8 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet8)
   goals met: 0 of 3
6. (take_image satellite0 planet8 instrument2 thermograph3)
   added: (have_image planet8 thermograph3)
   goals met: 1 of 3
7. (turn_to satellite0 planet7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet7)
   goals met: 1 of 3
8. (take_image satellite0 planet7 instrument2 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 2 of 3
9. (turn_to satellite0 phenomenon9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 3
10. (take_image satellite0 phenomenon9 instrument2 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 3 of 3
